#include<stdio.h>

main()

{
	long int i;

	int j, l;

	for (i = 10000; i <= 99999; i++)                     /*1. i:被除数*/

		if (i % 1000 - i % 100 == 400)             /*4. 被除数的第三位一定为4*/

			for (j = 10; j <= 99; j++)           /*1. j: 余数*/

				if (i % j == 0 && (l = i / j) % 100 >= 70 && l % 100 < 80 && l % 10 != 0 && l > 100 && l <= 999)

					/*1. 可以整除&& 2.商l在100到999之间且十位数字为7&&6.
商的个数不能为0*/

if ((j * (l % 10)) < 100 && j * (l % 10) > 10)    /*6. 商的个数与除
数的积为二位数*/

if (j * 7 % 100 >= 70 && j * 7 % 100 < 80)   /*5. 7乘以除数的积
的第二位为7*/

if (j * (l / 100) % 100 == 77 && j * (l / 100) > 100)

/*商的第一位与除数的积的后
两位为77*/

printf("%ld/%ld=%d\n", i, j, l);
}